app/views/students/show.html.erb

<%@student = Student.find(params["id"])%>
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]